{
  "greeting": "Home",
  "home": "Home",
  "storage": "StoragFrench",
  "moving": "Moving",
  "contact": "Contact",
  "LTL": "General Transport",
  "service": "Service",
  "rtwwu": "Ready to work with us ?",
  "contactus": "Contact us",
  "LTLTitle": "Less-than-truckload shipping",
  "FTLTitle": "FTL Service",
  "SDTTitle": "Same day Transport",
  "TCTTitle": "Temperature-Controlled Transportation",
  "fastDescription": "Be fast & furious",
  "socmedia": "Social Media",
  "be": "Be",
  "contactinfo": "Contact info",
  "whyusone": "Bridging distances between Canadian cities with our reliable and timely transport services",
  "whyustwo": "Effortlessly move your cargo across Canada with our efficient andreliable transport solutions",
  "whyusthree": "Streamline nationwide distribution with our efficient transport across Canada.",
  "fast": "fast",
  "smart": "smart",
  "storageAbout": "BET is more than a transportation company. We offers short, medium, and long-term warehousing solutions. From receiving to expedition, we also provide an array of related services to meet your every need. Ask for any information from our specialists and professionals who are able to meet all your storage needs and, in case of need, they can also provide a more complex plan including logistics services and storage management. Our warehouse is equipped with state of the art security system and 24 hours monitoring to ensure your goods remain secure",
  "copyright": "BET Transport Copyright © 2023 BET Transport - All rights reserved",
  "aboutInfo": "Welcome to BET Transport, your trusted transportation solutions partner based in Montreal, Canada. Established in 2021, we take pride in providing reliable and efficient trucking services to meet the diverse needs of our valued customers. At BET Transport, we understand the importance of reliable transportation in today's fast-paced world. Whether you need to transport goods locally or across Canada, our dedicated team is committed to ensuring your merchandise arrives safely and on time. Our fleet of modern, well-maintained trucks, combined with our team of experienced drivers, allows us to offer a wide range of transportation services. From general freight and perishable goods to oversized and specialty goods, we have the expertise and resources to meet your unique needs. What sets us apart is our unwavering commitment to customer satisfaction. We believe in building strong relationships with our clients based on trust, transparency and open communication. When you choose BET Transport, you can expect personalized attention, tailored solutions, and a seamless experience from start to finish.",
  "movingT1": "When you’re looking for a moving company, trust is probably the first item on your list. You have to be able to trust that your movers will handle your precious belongings as if they were their own. We take our jobs very seriously. Whether we’re handling a local or distance move for our customers in the Montreal area and beyond. Our team of experienced and courteous moving professionals can even pack and store things for you – and we do this for all of our customers – including residential end commercial",
  "movingT2": "Packing items yourself can be very stressful and time consuming, especially on the day of the move. If you can`t pack it up, it can delay and extend your move, costing you time and money. We provide packing service of as high standard as our moving service, helping you to pack your stuff professionally. We take great care in packing your dishes, glasses, kitchen utensils, artwork, photos, electronics, storage items and personal belongings in your home.",
  "movingT3": "Storage can be an obstacle that arises during your move. At BET Transport, we offer a variety of simple storage options to meet your needs. Whether you need short-term or long-term storage, you can count on our secure warehouse to protect your furniture and belongings. We are able to accommodate any size of storage, we can guard your belongings temporarily if you need an extra day to prepare to move in.",
  "movingT4": "Our management team is dedicated to provide the best transport and warehouse  solutions for our clients.",
  "LTLAbout": "We offesrs less-than-truckload (LTL) . LTL or less than truckload shipping is when the shipper, whether that is the manufacturer or distributor of the goods, utilizes a common carrier’s network of to move a smaller shipment across the city or country.",
  "FTL": "Whilst we specialize in LTL shipments (part loads)  Transport B.E.T.  also offers a full truckload (FTL) services to and from Canada’s largest citie – Montreal",
  "SDTAbout": "Need something in a hurry, do you have the shipment that need to go to its destination as soon as possible, we are just one call away from you",
  "TCT": "We maintain the temperature according to the goods being transported. This allows us to easily carry out any refrigerated or temperature-controlled transportation.",
  "getAquote": "Get a Quote",
  "betIsMore": "BET is more than a transportation company. We offers short, medium, and long-term warehousing solutions. From receiving to expedition, we also provide an array of related services to meet your every need. Ask for any information from our specialists and professionals who are able to meet all your storage needs and, in case of need, they can also provide a more complex plan including logistics services and storage management. Our warehouse is equipped with state of the art security system and 24 hours monitoring to ensure your goods remain secure  Our warehouse is equipped with state of the art security system and 24 hours monitoring to ensure your goods remain secure",
  "homeAbout2": "From small apartment moves to full service jobs in huge houses, our professional and expertly trained movers handle your possessions with the utmost precision and care.",
  "homeAbout3": "We offers short, medium, and long-term warehousing solutions",
  "UCBOU": "You can bet on us !",
  "saveOnTime": "Safe and on time delivery",
  "profTransport": "Professional Transpot",
  "profSerc": "Professional services with experience",
  "BETIsMont": "BET Transport is Montreal based Transportation Company providing exemplary service from the point of departure to the point of arrival. We transport all types of goods, we strive to provide our clients with the best possible logistics and transportation service, offering solutions adapted to their specific needs. Also Transport BET offers storage space to meet all of your warehousing needs end our moving division provides the best service in the Greater Montreal area.",
  "FTLServ": "FTL Service",
  "LTLServ": "LTL Service",
  "SamedayTransport": "Same day Transport",
  "Tempcontrltrans": "Temperature controlled transportation",
  "Readmore": "Read more",
  "FSmA": "From small apartment moves to full service jobs in huge houses, our professional and expertly trained movers handle your possessions with the utmost precision and care.",
  "WoSh": "We offers short, medium, and long-term warehousing solutions",
  "betTrucks": "BET Trucks",
  "beBET": "Be modern, be BET",
  "Whayc": "What are your commercial storage needs? BET has the commercial storage services you need to store any type of commodity. Also we offer full cross-docking services for our customers, we can move cargo from one vehicle to another with little or no storage time in between to streamline the distribution and warehousing process",
  "WoAEw": "We offer an excellent winter storage deal that will allow your bike to spend the winter in a warm, cozy room. So when the weather gets too cold to ride, give your bike a good home for the winter-bring it to us. We can pick up and deliver your bike directly to your home",
  "WtEh": "When the entire home and office space is cluttered and you are moving to a new home or office building, we have a solution for you, our storage is a safe place where you can store your things for a short or long time.",
  "BetTrInc": "BET Transport Inc.",
  "phone": "Phone",
  "FirstName": "First Name",
  "LastName": "Last Name",
  "Message": "Message",
  "Submit": "Submit"
}
